<?php

class Topic2Widget extends Action {

    public function topic($key, $bool=false){
        $topic = array(
            1 => array(
                'title' => '各种新奇节日的风生水起',
                'color' => 'jv',
                'host_name' => '苏芩',
                'uid' => '1249159055',
                'host_image' => 'http://tp4.sinaimg.cn/1249159055/180/5671235294/0',
                'content' => '说起过节，大家的兴奋点应该只会放在放假上了，过节几乎已经失去了节日本身的意义，不过在网络上，大家却创造了许多新的节日，并且过的热热闹闹，风生水起，像是即将要来的12.12示爱日，11.11光棍节，10.10萌节，8.18八卦节，5.20我爱你情人节…..也许比起传统节日，这些搞怪的节日更能满足现代人的心理，在一个特定的日子，抒发现代人特有的感慨。',
                'comment' => array(
                    1 => array(
                        'uid' => '1798032167',
                        'user_name' => 'Mike_D',
                        'user_image' => 'http://tp4.sinaimg.cn/1798032167/50/5662076524/1',
                        'content' => '日子总是忙忙碌碌，很多节日要不是因为网友，真的就想不起来了。',
                    ),
                    2 => array(
                        'uid' => '1647415197',
                        'user_name' => '暖小团',
                        'user_image' => 'http://tp2.sinaimg.cn/1647415197/50/5645603258/0',
                        'content' => '皆大欢喜的节没意思，部分人欢喜的节我过不上，总结起来就是，不喜欢过节。',
                    ),
                ),
            ),
            2 => array(
                'title' => '租个对象回家为了谁',
                'color' => 'lv',
                'host_name' => '暖小团',
                'uid' => '1647415197',
                'host_image' => 'http://tp2.sinaimg.cn/1647415197/180/5645603258/0',
                'content' => '有个电视剧，叫租个女友回家过年，火了，作为它的连锁效应，现实中效仿剧中租对象回家过年的不在少数，这种现象也引起了许多争议，褒贬两方都各有道理，其实吧，也许最后才会发现，一个人的时候想有个伴，两个人的时候觉得还不如一只手。所以如果你不想在假象破灭后承受更大的失落感，干脆就不用租个对象忽悠老爸老妈了，但觉得有希望假戏真做，终成眷属的，就勇敢地去追求你的幸福吧…',
                'comment' => array(
                    1 => array(
                        'uid' => '1249159055',
                        'user_name' => '苏芩',
                        'user_image' => 'http://tp4.sinaimg.cn/1249159055/50/5671235294/0',
                        'content' => '爱情里，缘分很重要，但没有双方的努力，也只能是一场男女的邂逅而已。',
                    ),
                    2 => array(
                        'uid' => '1798032167',
                        'user_name' => 'Mike_D',
                        'user_image' => 'http://tp4.sinaimg.cn/1798032167/50/5662076524/1',
                        'content' => '思念是一种病，多少单身心里住着一个得不到的人，愿天下善男信女都能找到自己的幸福。',
                    ),

                ),
            ),
            3 => array(
                'title' => '年终奖快到碗里来',
                'color' => 'zi',
                'host_name' => 'Mike_D',
                'uid' => '1798032167',
                'host_image' => 'http://tp4.sinaimg.cn/1798032167/180/5662076524/1',
                'content' => '对于广大月光族来说，连续奋斗并挥霍了数月，急需一笔飞来横财帮忙还上最后一笔贷款，那就是年终奖了~除了月光族，出来混的各业人士对于年终奖也是非常看重的，它已然是年底邻里街坊，狐朋狗友间谈资的重磅话题，不过几家欢喜几家愁,有拿着年终奖得瑟到天上的,也有发完工资就没什么盼头的,没有年终奖的人总是安慰自己,没关系,有很多人都没有年终奖,我们全公司大家都没有呢……',
                'comment' => array(
                    1 => array(
                        'uid' => '1647415197',
                        'user_name' => '暖小团',
                        'user_image' => 'http://tp2.sinaimg.cn/1647415197/50/5645603258/0',
                        'content' => '向前看？向钱看？一年一次的春节假期才是头等大事，你感受下。。。',
                    ),
                    2 => array(
                        'uid' => '1249159055',
                        'user_name' => '苏芩',
                        'user_image' => 'http://tp4.sinaimg.cn/1249159055/50/5671235294/0',
                        'content' => '年底是收获的季节，除了年终奖，总结自己过去的一年同样意义非凡，为新的一年加油打气吧',
                    ),
                ),
            ),
        );
        if($bool){
            return $topic;
        }else{
            return $topic[$key];
        }
    }
} 